results/cpu-vs-latency4/memcached/5-3/nsl205.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     2201810 ops,   72796 (avg:   73392) ops/sec, 2.75MB/sec (avg: 2.77MB/sec),  1.10 (avg:  1.09) msec latency

5         Threads
16        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        6673.33          ---          ---      1.09500       494.67
Gets       66719.62     13491.43     53228.18      1.08600      2339.54
Totals     73392.95     13491.43     53228.18      1.08600      2834.21


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.000     92.58299
SET       2.000     94.67837
SET       3.000     96.71432
SET       4.000     97.01202
SET       5.000     99.70730
SET       6.000     99.97353
SET       7.000     99.98951
SET       8.000     99.99001
SET      11.000     99.99051
SET      12.000     99.99101
SET      15.000     99.99151
SET      16.000     99.99201
SET      17.000     99.99301
SET      18.000     99.99351
SET      19.000     99.99401
SET      20.000     99.99451
SET      37.000     99.99501
SET      39.000     99.99550
SET      41.000     99.99600
SET      44.000     99.99650
SET      68.000     99.99700
SET      70.000     99.99750
SET      73.000     99.99800
SET      76.000     99.99850
SET     120.000    100.00000
---
GET       0.130      0.00005
GET       0.140      0.00030
GET       0.150      0.00065
GET       0.160      0.00105
GET       0.170      0.00125
GET       0.180      0.00165
GET       0.190      0.00320
GET       0.200      0.00425
GET       0.210      0.00525
GET       0.220      0.00610
GET       0.230      0.00759
GET       0.240      0.01069
GET       0.250      0.01519
GET       0.260      0.01834
GET       0.270      0.02183
GET       0.280      0.02693
GET       0.290      0.03347
GET       0.300      0.03922
GET       0.310      0.04381
GET       0.320      0.04801
GET       0.330      0.05336
GET       0.340      0.05990
GET       0.350      0.06760
GET       0.360      0.07584
GET       0.370      0.08593
GET       0.380      0.09892
GET       0.390      0.11840
GET       0.400      0.13584
GET       0.410      0.15348
GET       0.420      0.16821
GET       0.430      0.18500
GET       0.440      0.19919
GET       0.450      0.21453
GET       0.460      0.22782
GET       0.470      0.24400
GET       0.480      0.26224
GET       0.490      0.28922
GET       0.500      0.32709
GET       0.510      0.38289
GET       0.520      0.48831
GET       0.530      0.69294
GET       0.540      1.07988
GET       0.550      1.80325
GET       0.560      3.06703
GET       0.570      5.12973
GET       0.580      8.22808
GET       0.590     12.54381
GET       0.600     17.96291
GET       0.610     24.17751
GET       0.620     30.64071
GET       0.630     36.57110
GET       0.640     41.38912
GET       0.650     44.89540
GET       0.660     47.31776
GET       0.670     48.86921
GET       0.680     49.83243
GET       0.690     50.42871
GET       0.700     50.80580
GET       0.710     51.07968
GET       0.720     51.28751
GET       0.730     51.45663
GET       0.740     51.60296
GET       0.750     51.73236
GET       0.760     51.85206
GET       0.770     51.96062
GET       0.780     52.07303
GET       0.790     52.20203
GET       0.800     52.34152
GET       0.810     52.52072
GET       0.820     52.74964
GET       0.830     53.06124
GET       0.840     53.48040
GET       0.850     54.00798
GET       0.860     54.63322
GET       0.870     55.34001
GET       0.880     56.11888
GET       0.890     56.89466
GET       0.900     57.63007
GET       0.910     58.30747
GET       0.920     58.93966
GET       0.930     59.51755
GET       0.940     60.08329
GET       0.950     60.67936
GET       0.960     61.35162
GET       0.970     62.16857
GET       0.980     63.13724
GET       0.990     64.23301
GET       1.000     70.66843
GET       1.100     74.10312
GET       1.200     80.39436
GET       1.300     87.13769
GET       1.400     89.45278
GET       1.500     89.68275
GET       1.600     89.71687
GET       1.700     90.06948
GET       1.800     91.03041
GET       1.900     92.12024
GET       2.000     93.71960
GET       2.100     94.48998
GET       2.200     94.58360
GET       2.300     94.59819
GET       2.400     94.60124
GET       2.500     94.61988
GET       2.600     94.68068
GET       2.700     94.73014
GET       2.800     94.74123
GET       2.900     94.74582
GET       3.000     94.74912
GET       3.100     94.75352
GET       3.200     94.76066
GET       3.300     94.77770
GET       3.400     94.82901
GET       3.500     94.98513
GET       3.600     95.33920
GET       3.700     95.84259
GET       3.800     96.33235
GET       3.900     96.66438
GET       4.000     96.83200
GET       4.100     96.89225
GET       4.200     96.90978
GET       4.300     96.91413
GET       4.400     96.91618
GET       4.500     96.91943
GET       4.600     96.92482
GET       4.700     96.93786
GET       4.800     96.96334
GET       4.900     97.01005
GET       5.000     97.09454
GET       5.100     97.24007
GET       5.200     97.46064
GET       5.300     97.73952
GET       5.400     98.07954
GET       5.500     98.44945
GET       5.600     98.85542
GET       5.700     99.21413
GET       5.800     99.48921
GET       5.900     99.68266
GET       6.000     99.82789
GET       6.100     99.91362
GET       6.200     99.95823
GET       6.300     99.97947
GET       6.400     99.98706
GET       6.500     99.98931
GET       6.600     99.99011
GET       6.700     99.99071
GET       6.800     99.99121
GET       6.900     99.99196
GET       7.000     99.99291
GET       7.100     99.99415
GET       7.200     99.99580
GET       7.300     99.99680
GET       7.400     99.99745
GET       7.500     99.99840
GET       7.600     99.99880
GET       7.700     99.99890
GET       7.800     99.99900
GET       7.900     99.99905
GET       8.000     99.99925
GET       8.100     99.99975
GET       8.200     99.99980
GET       8.300    100.00000